#
## Используйте официальный образ Java 17
#FROM openjdk:17-alpine
#
## Устанавливаем рабочую директорию внутри контейнера
#WORKDIR /app
#
## Копируем JAR файл внутрь контейнера
#COPY target/Sport-0.0.1-SNAPSHOT.jar app.jar
#
## Указываем порт, который приложение будет слушать (если ваше приложение слушает на другом порту, измените соответственно)
#EXPOSE 8080
#
## Запускаем приложение при старте контейнера
##CMD ["java", "-jar", "app.jar"]
#
#
## Копируем файлы с зависимостями для PostgreSQL JDBC
#COPY target/dependency/* /app/
#
## Указываем порт, который приложение будет слушать (если ваше приложение слушает на другом порту, измените соответственно)
#EXPOSE 8109
#
## Запускаем приложение при старте контейнера
#CMD ["java", "-cp", "app.jar:lib/*", "com.example.Sport.SportApplication"]



# Используйте официальный образ Java 17
#FROM openjdk:17-alpine
#
## Устанавливаем рабочую директорию внутри контейнера
#WORKDIR /app
#
## Копируем JAR файл внутрь контейнера
#COPY target/Sport-0.0.1-SNAPSHOT.jar app.jar
#
## Указываем порт, который приложение будет слушать (если ваше приложение слушает на другом порту, измените соответственно)
#EXPOSE 8080
#
## Запускаем приложение при старте контейнера
##CMD ["java", "-jar", "app.jar"]
#
## Копируем файлы с зависимостями для PostgreSQL JDBC
#COPY target/*-SNAPSHOT.jar /app/app.jar
#
## Указываем порт, который приложение будет слушать (если ваше приложение слушает на другом порту, измените соответственно)
#EXPOSE 8111
#
## Запускаем приложение при старте контейнера
#CMD ["java", "-cp", "app.jar:lib/*", "com.example.Sport.SportApplication"]


# Используйте официальный образ Java 17
FROM openjdk:17-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем JAR файл внутрь контейнера
COPY target/Sport-0.0.1-SNAPSHOT.jar app.jar

# Открываем порт, который приложение будет слушать
EXPOSE 8111

# Запускаем приложение при старте контейнера
CMD ["java", "-jar", "app.jar"]